system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001;

vertices
(
    (-3.536 -3.536   0)  // 0
    ( 3.536 -3.536   0)  // 1
    ( 3.536  3.536   0)  // 2
    (-3.536  3.536   0)  // 3
    ( 5.0    0.0     0)  // 4
    ( 0.0    5.0     0)  // 5
    (-5.0    0.0     0)  // 6
    ( 0.0   -5.0     0)  // 7

    (-1.061 -1.061  40)  // 8
    ( 1.061 -1.061  40)  // 9
    ( 1.061  1.061  40)  // 10
    (-1.061  1.061  40)  // 11
    ( 1.5    0.0    40)  // 12
    ( 0.0    1.5    40)  // 13
    (-1.5    0.0    40)  // 14
    ( 0.0   -1.5    40)  // 15

    (-1.467 -1.467 140)  // 16
    ( 1.467 -1.467 140)  // 17
    ( 1.467  1.467 140)  // 18
    (-1.467  1.467 140)  // 19
    ( 2.075  0.0   140)  // 20
    ( 0.0    2.075 140)  // 21
    (-2.075  0.0   140)  // 22
    ( 0.0   -2.075 140)  // 23
    ( 30.0   0.0   140)  // 24
    ( 0.0   30.0   140)  // 25
    (-30.0   0.0   140)  // 26
    ( 0.0  -30.0   140)  // 27

    (-1.467 -1.467 300)  // 28
    ( 1.467 -1.467 300)  // 29
    ( 1.467  1.467 300)  // 30
    (-1.467  1.467 300)  // 31
    ( 2.075  0.0   300)  // 32
    ( 0.0    2.075 300)  // 33
    (-2.075  0.0   300)  // 34
    ( 0.0   -2.075 300)  // 35
    ( 30.0   0.0   300)  // 36
    ( 0.0   30.0   300)  // 37
    (-30.0   0.0   300)  // 38
    ( 0.0  -30.0   300)  // 39
);

blocks
(
    hex (0 1 2 3   8  9 10 11)  conv_core (20 20 30) simpleGrading (1 1 1)
    hex (1 4 5 2   9 12 13 10)  conv_px   (10 20 30) simpleGrading (4 1 1)
    hex (3 2 5 6  11 10 13 14)  conv_py   (10 20 30) simpleGrading (4 1 1)
    hex (0 3 6 7   8 11 14 15)  conv_mx   (10 20 30) simpleGrading (4 1 1)
    hex (7 0 1 4  15  8  9 12)  conv_my   (10 20 30) simpleGrading (4 1 1)

    hex ( 8  9 10 11  16 17 18 19)  div_core (20 20 80) simpleGrading (1 1 1)
    hex ( 9 12 13 10  17 20 21 18)  div_px   (10 20 80) simpleGrading (4 1 1)
    hex (11 10 13 14  19 18 21 22)  div_py   (10 20 80) simpleGrading (4 1 1)
    hex ( 8 11 14 15  16 19 22 23)  div_mx   (10 20 80) simpleGrading (4 1 1)
    hex (15 8  9 12   23 16 17 20)  div_my   (10 20 80) simpleGrading (4 1 1)

    hex (16 17 18 19  28 29 30 31)  ambin_core (20 20 100) simpleGrading (1 1 1)
    hex (17 20 21 18  29 32 33 30)  ambin_px   (10 20 100) simpleGrading (4 1 1)
    hex (19 18 21 22  31 30 33 34)  ambin_py   (10 20 100) simpleGrading (4 1 1)
    hex (16 19 22 23  28 31 34 35)  ambin_mx   (10 20 100) simpleGrading (4 1 1)
    hex (23 16 17 20  35 28 29 32)  ambin_my   (10 20 100) simpleGrading (4 1 1)

    hex (20 24 25 21  32 36 37 33)  ambout_px  (20 20 100) simpleGrading (4 1 1)
    hex (21 25 26 22  33 37 38 34)  ambout_py  (20 20 100) simpleGrading (4 1 1)
    hex (22 26 27 23  34 38 39 35)  ambout_mx  (20 20 100) simpleGrading (4 1 1)
    hex (23 27 24 20  35 39 36 32)  ambout_my  (20 20 100) simpleGrading (4 1 1)
);

edges
(
    arc 4 5  ( 3.5355  3.5355  0)
    arc 5 6  (-3.5355  3.5355  0)
    arc 6 7  (-3.5355 -3.5355  0)
    arc 7 4  ( 3.5355 -3.5355  0)

    arc 12 13  ( 1.0607  1.0607  40)
    arc 13 14  (-1.0607  1.0607  40)
    arc 14 15  (-1.0607 -1.0607  40)
    arc 15 12  ( 1.0607 -1.0607  40)

    arc 20 21  ( 1.4672  1.4672  140)
    arc 21 22  (-1.4672  1.4672  140)
    arc 22 23  (-1.4672 -1.4672  140)
    arc 23 20  ( 1.4672 -1.4672  140)

    arc 24 25  ( 21.2132  21.2132  140)
    arc 25 26  (-21.2132  21.2132  140)
    arc 26 27  (-21.2132 -21.2132  140)
    arc 27 24  ( 21.2132 -21.2132  140)

    arc 32 33  ( 1.4672  1.4672  300)
    arc 33 34  (-1.4672  1.4672  300)
    arc 34 35  (-1.4672 -1.4672  300)
    arc 35 32  ( 1.4672 -1.4672  300)

    arc 36 37  ( 21.2132  21.2132  300)
    arc 37 38  (-21.2132  21.2132  300)
    arc 38 39  (-21.2132 -21.2132  300)
    arc 39 36  ( 21.2132 -21.2132  300)
);

boundary
(
    Input
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (1 4 5 2)  // wrong - fix
            (3 6 5 2)
            (0 7 6 3)
            (7 4 1 0)
        );
    }
    Output
    {
        type patch;
        faces
        (
            (28 31 30 29)
            (29 32 33 30) (30 33 34 31)
            (31 34 35 28) (28 35 32 29)
            (32 36 37 33) (33 37 38 34)
            (34 38 39 35) (35 39 36 32)
        );
    }
    NozzleWall
    {
        type wall;
        faces
        (
            (4 12 13 5)  (5 13 14 6)
            (6 14 15 7)  (7 15 12 4)
            (12 20 21 13) (13 21 22 14)
            (14 22 23 15) (15 23 20 12)
        );
    }
    AmbientSide
    {
        type patch;
        faces
        (
            (20 24 25 21) (21 25 26 22)
            (22 26 27 23) (23 27 24 20)
            (24 36 37 25) (25 37 38 26)
            (26 38 39 27) (27 39 36 24)
        );
    }
);
