system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
    { name Input; patchInfo { type patch; } constructFrom set; set inputFaces; }
    { name NozzleWall; patchInfo { type wall; } constructFrom set; set nozzleWallFaces; }
);
