0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    Input           { type zeroGradient; }
    Output          { type zeroGradient; }
    NozzleWall      { type slip; }
    AmbientSide     { type pressureInletOutletVelocity; value uniform (0 0 0); }
    defaultFaces    { type slip; }
}
