0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101000;

boundaryField
{
    NozzleWall
    {
        type            zeroGradient;
    }
    Output
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101000;
        lInf            0.3675;
        value           uniform 101000;
    }
    Input
    {
        type            totalPressure;
        rho             rho;
        psi             psi;
        gamma           1.4;
        p0              uniform 1000000;
        value           uniform 1000000;
    }
    AmbientSide
    {
        type            totalPressure;
        rho             rho;
        psi             psi;
        gamma           1.4;
        p0              uniform 101000;
        value           uniform 101000;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
