0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    Input           { type calculated; value uniform 0; }
    Output          { type calculated; value uniform 0; }
    NozzleWall      { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
    AmbientSide     { type calculated; value uniform 0; }
    defaultFaces    { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
}
