0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    Input           { type fixedValue; value uniform 1; }
    Output          { type zeroGradient; }
    NozzleWall      { type kqRWallFunction; value uniform 1; }
    AmbientSide     { type inletOutlet; inletValue uniform 1; value uniform 1; }
    defaultFaces    { type kqRWallFunction; value uniform 1; }
}
