0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1000;
boundaryField
{
    Input           { type fixedValue; value uniform 1000; }
    Output          { type zeroGradient; }
    NozzleWall      { type omegaWallFunction; value uniform 1000; }
    AmbientSide     { type inletOutlet; inletValue uniform 1000; value uniform 1000; }
    defaultFaces    { type omegaWallFunction; value uniform 1000; }
}
