system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    pFinal
    {
        $p;
    }

    "(U|e|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|e|k|omega)Final"
    {
        $U;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
}



fieldBounds
{
    p     50 2e6;
    T     50 2000;
    U     2000;
}
