system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Sample line runs slightly above the symmetry axis (x = 0.0005 m = 0.5 mm)
// along the full nozzle length in the z-direction (z = 0 to 0.1 m).
// x = 0.0005 m is ~10% of the inlet radius, consistent with Robinson (2016).

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    axialLine
    {
        type        uniform;
        axis        distance;
        start       ( 0.0005  0.0  0.002 );   // 0.5 mm from axis, z = 2 mm
        end         ( 0.0005  0.0  0.098 );   // 0.5 mm from axis, z = 98 mm
        nPoints     100;
    }
);

fields ( p U T );

// ************************************************************************* //
