system/topoSetDict
FoamFile { version 2.0; format ascii; class dictionary; object topoSetDict; }
actions
(
    { name inputFaces; type faceSet; action new; source normalToFace; normal (0 0 -1); cos 0.1; }
    { name inputFaces; type faceSet; action subset; source boxToFace; box (-10 -10 -0.001) (10 10 0.001); }
);
